#  Exploratory  Data

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('payment_dataset.csv')

In [3]:
df.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99330.0
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24390.0
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65710.0
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107780.0
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128450.0

In [4]:
df.describe(include=object)
#string values

                                order_id payment_type
count                             103886       103886
unique                             99440            5
top     fa65dad1b0e818e3ccc5cb0e39231352  credit_card
freq                                  29        76795

In [5]:
df.describe()
#the only numeric values

       payment_sequential  payment_installments  payment_value
count       103886.000000         103886.000000   1.038860e+05
mean             1.092679              2.853349   1.541004e+05
std              0.706584              2.687051   2.174941e+05
min              1.000000              0.000000   0.000000e+00
25%              1.000000              1.000000   5.679000e+04
50%              1.000000              1.000000   1.000000e+05
75%              1.000000              4.000000   1.718375e+05
max             29.000000             24.000000   1.366408e+07

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.shape
# (rows,columns)

(103886, 5)

In [8]:
len(df)
#number of rows

103886

In [9]:
df.tail()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
103881,0406037ad97740d563a178ecc7a2075c,1,blipay,1,363310.0
103882,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96800.0
103883,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47770.0
103884,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369540.0
103885,28bbae6599b09d39ca406b747b6632b1,1,blipay,1,191580.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [11]:
df.notnull()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,True,True,True,True,True
1,True,True,True,True,True
2,True,True,True,True,True
3,True,True,True,True,True
4,True,True,True,True,True
...,...,...,...,...,...
103881,True,True,True,True,True
103882,True,True,True,True,True
103883,True,True,True,True,True
103884,True,True,True,True,True
103885,True,True,True,True,True

#  Data Transformation

In [12]:
# Convert the 'user_name' ,user_city,user_state column from object to string
df['order_id'] = df['order_id'].astype("string")
df['payment_type'] = df['payment_type'].astype("string")

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  string
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  string
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), string(2)
memory usage: 4.0 MB

In [14]:
# length of cell i user_name column
len(df.at[0, 'order_id'])

32

In [15]:
# length of cell i user_name column
len(df.at[0, 'payment_type'])

11

In [16]:
df = df.assign(payment_id=range(1, len(df) + 1))  # Start from 1

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 6 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  string
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  string
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
 5   payment_id            103886 non-null  int64
dtypes: float64(1), int64(3), string(2)
memory usage: 4.8 MB

In [19]:
# altering the DataFrame
df = df[['payment_id', 'order_id', 'payment_sequential','payment_type','payment_installments','payment_value']]

In [20]:
df.head()

,payment_id,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,1,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99330.0
1,2,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24390.0
2,3,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65710.0
3,4,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107780.0
4,5,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128450.0

In [21]:
df.tail()

,payment_id,order_id,payment_sequential,payment_type,payment_installments,payment_value
103881,103882,0406037ad97740d563a178ecc7a2075c,1,blipay,1,363310.0
103882,103883,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96800.0
103883,103884,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47770.0
103884,103885,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369540.0
103885,103886,28bbae6599b09d39ca406b747b6632b1,1,blipay,1,191580.0

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 6 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   payment_id            103886 non-null  int64
 1   order_id              103886 non-null  string
 2   payment_sequential    103886 non-null  int64
 3   payment_type          103886 non-null  string
 4   payment_installments  103886 non-null  int64
 5   payment_value         103886 non-null  float64
dtypes: float64(1), int64(3), string(2)
memory usage: 4.8 MB

In [24]:
# Export the DataFrame to a CSV file
df.to_csv('payment_dataset_1.csv', index=False)